In [1]:
import numpy as np 
import matplotlib.pyplot as plt 
import pandas as pd

In [2]:
fake_data = [
    {'city':'lucknow','temp':30,'rainfall':10},
    {'city':'kanpur','temp':20,'rainfall':20},
    {'city':'agra','temp':10,'rainfall':30},
    {'city':'delhi','temp':40,'rainfall':40},
]

In [3]:
pd.DataFrame(fake_data)

      city  temp  rainfall
0  lucknow    30        10
1   kanpur    20        20
2     agra    10        30
3    delhi    40        40